# -*- encoding: utf-8 -*-

# 三级联动
# 常见：字典实现
cities = {
    '江苏省': {
        '南京市': ['玄武区', '鼓楼区', '秦淮区', '建邺区', '栖霞区', '江宁区', '浦口区', '六合区', '溧水区', '高淳区', '雨花台区'],
        '无锡市': ['梁溪区', '滨湖区', '新吴区', '锡山区', '惠山区', '江阴市', '宜兴市'],
        '徐州市': ['云龙区', '泉山区', '鼓楼区', '贾汪区', '铜山区', '丰县', '沛县', '睢宁县', '邳州市', '新沂市'],
        '常州市': ['新北区', '天宁区', '钟楼区', '金坛区', '武进区', '溧阳市'],
        '苏州市': ['姑苏区', '虎丘区', '相城区', '吴中区', '吴江区', '昆山市', '太仓市', '常熟市', '张家港市'],
        '南通市': ['崇川区', '港闸区', '通州区', '如东县', '如皋市', '海门市', '海安市', '启东市'],
        '连云港市': ['海州区', '连云区', '赣榆区', '东海县', '灌云县', '灌南县'],
        '淮安市': ['淮安区', '淮阴区', '洪泽区', '清江浦区', '涟水县', '盱眙县', '金湖县'],
        '盐城市': ['亭湖区', '盐都区', '大丰区', '响水县', '射阳县', '滨海县', '阜宁县', '建湖县', '东台市'],
        '扬州市': ['广陵区', '邗江区', '江都区', '宝应县', '仪征市', '高邮市'],
        '镇江市': ['京口区', '润州区', '丹徒区', '扬中市', '丹阳市', '句容市'],
        '泰州市': ['海陵区', '高港区', '姜堰区', '泰兴市', '靖江市', '兴化市'],
        '宿迁市': ['宿城区', '宿豫区', '沭阳县', '泗阳县', '泗洪县']
    },
    '四川省': {
        '成都市': [
            '锦江区', '青羊区', '金牛区', '武侯区', '成华区', '青白江区', '龙泉驿区', '新都区', '温江区', '双流区', '郫都区', '金堂县', '大邑县', '蒲江县', '新津县',
            '都江堰市', '彭州市', '崇州市', '邛崃市', '简阳市'
        ],
        '绵阳市': ['涪城区', '游仙区', '安州区', '江油市', '梓潼县', '三台县', '盐亭县', '平武县', '北川羌族自治县'],
        '自贡市': ['自流井区', '贡井区', '大安区', '沿滩区', '荣县', '富顺县'],
        '攀枝花市': ['东区', '西区', '仁和区', '米易县', '盐边县'],
        '泸州市': ['江阳区', '龙马潭区', '纳溪区', '泸县', '合江县', '叙永县', '古蔺县'],
        '德阳市': ['旌阳区', '罗江区', '广汉市', '什邡市', '绵竹市', '中江县'],
        '广元市': ['利州区', '昭化区', '朝天区', '旺苍县', '青川县', '剑阁县', '苍溪县'],
        '遂宁市': ['船山区', '安居区', '射洪市', '蓬溪县', '大英县'],
        '内江市': ['市中区', '东兴区', '隆昌市', '资中县', '威远县'],
        '乐山市': ['市中区', '沙湾区', '五通桥区', '金口河区', '峨眉山市', '犍为县', '井研县', '夹江县', '沐川县', '峨边彝族自治县', '马边彝族自治县'],
        '资阳市': ['雁江区', '安岳县', '乐至县'],
        '宜宾市': ['叙州区', '翠屏区', '南溪区', '江安县', '长宁县', '高县', '筠连县', '珙县', '兴文县', '屏山县'],
        '南充市': ['顺庆区', '高坪区', '嘉陵区', '阆中市', '西充县', '南部县', '蓬安县', '营山县', '仪陇县'],
        '达州市': ['通川区', '达川区', '万源市', '渠县', '大竹县', '宣汉县', '开江县'],
        '雅安市': ['雨城区', '名山区', '荥经县', '汉源县', '石棉县', '天全县', '芦山县', '宝兴县'],
        '阿坝藏族羌族自治州': ['马尔康市', '金川县', '小金县', '阿坝县', '若尔盖县', '红原县', '壤塘县', '汶川县', '理县', '茂县', '松潘县', '九寨沟县', '黑水县'],
        '甘孜藏族自治州': [
            '康定市', '泸定县', '丹巴县', '九龙县', '雅江县', '道孚县', '炉霍县', '甘孜县', '新龙县', '德格县', '白玉县', '石渠县', '色达县', '理塘县', '巴塘县',
            '乡城县', '稻城县', '得荣县'
        ],
        '凉山彝族自治州': [
            '西昌市', '德昌县', '会理县', '会东县', '宁南县', '普格县', '布拖县', '昭觉县', '金阳县', '雷波县', '美姑县', '甘洛县', '越西县', '喜德县', '冕宁县',
            '盐源县', '木里藏族自治县'
        ],
        '广安市': ['广安区', '前锋区', '华蓥市', '岳池县', '武胜县', '邻水县'],
        '巴中市': ['巴州区', '恩阳区', '平昌县', '通江县', '南江县'],
        '眉山市': ['东坡区', '彭山区', '仁寿县', '丹棱县', '青神县', '洪雅县']
    },
    '北京市': [
        '东城区', '西城区', '朝阳区', '丰台区', '石景山区', '海淀区', '顺义区', '通州区', '大兴区', '房山区', '门头沟区', '昌平区', '平谷区', '密云区', '怀柔区',
        '延庆区'
    ]
}
for k1, v1 in cities.items():
    print(k1)
    if type(v1) == dict:
        for k2, v2 in v1.items():
            print('----%s' % k2)
            for s in v2:
                print('--------%s' % s)
    elif type(v1) == list:
        for s in v1:
            print('----%s' % s)
    else:
        print("something bad has happened!")
